IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
static uint32_t Camera_SDStorage_SwitchConflictPinsToSdioAf12(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.sdio_af12_switch_attempt_count;

    /* 只将 PC8、PC9、PC11 切换为 SDIO AF12，不处理 PC10、PC12、PD2。 */
    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF12_SDIO;
    HAL_GPIO_Init(GPIOC, &gpio);

    /* 进入复用态后已不再是 GPIO 输入释放态。 */
    s_camera_sd_status.conflict_pins_released = 0U;

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_AF_MODE) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_PULLUP) ||
        ((GPIOC->OSPEEDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_SPEED_VERY_HIGH) ||
        ((GPIOC->OTYPER & CAMERA_SD_CONFLICT_PIN_MASK) != 0U) ||
        ((GPIOC->AFR[1] & CAMERA_SD_CONFLICT_AFRH_MASK) !=
         CAMERA_SD_CONFLICT_AFRH_AF12))
    {
        ++s_camera_sd_status.sdio_af12_switch_error_count;
        s_camera_sd_status.sdio_af12_selected = 0U;
        s_camera_sd_status.last_sdio_af12_error_code =
            CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED;
        s_camera_sd_status.last_sdio_af12_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED;
    }

    ++s_camera_sd_status.sdio_af12_switch_success_count;
    s_camera_sd_status.sdio_af12_selected = 1U;
    s_camera_sd_status.last_sdio_af12_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_af12_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_LeaveSdioAf12ToInput(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.sdio_af12_restore_attempt_count;

    /* 只将 PC8、PC9、PC11 从 SDIO AF12 退回无上下拉的 GPIO 输入态。 */
    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) != 0U) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) != 0U))
    {
        ++s_camera_sd_status.sdio_af12_restore_error_count;
        s_camera_sd_status.sdio_af12_selected = 0U;
        s_camera_sd_status.conflict_pins_released = 0U;
        s_camera_sd_status.last_sdio_af12_error_code =
            CAMERA_SD_ERR_SDIO_AF12_RESTORE_FAILED;
        s_camera_sd_status.last_sdio_af12_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SDIO_AF12_RESTORE_FAILED;
    }

    ++s_camera_sd_status.sdio_af12_restore_success_count;
    s_camera_sd_status.sdio_af12_selected = 0U;
    s_camera_sd_status.conflict_pins_released = 1U;
    s_camera_sd_status.last_sdio_af12_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_af12_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_SwitchFullSdioGpioToAf12(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.sdio_full_gpio_switch_attempt_count;

    /* 配置 PC8、PC9、PC10、PC11、PC12 为完整 SDIO GPIO 的 AF12。 */
    gpio.Pin = CAMERA_SD_FULL_GPIOC_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF12_SDIO;
    HAL_GPIO_Init(GPIOC, &gpio);

    /* 配置 PD2 为 SDIO_CMD 的 AF12，不访问 SDIO 外设。 */
    gpio.Pin = CAMERA_SD_FULL_GPIOD_PIN_MASK;
    HAL_GPIO_Init(GPIOD, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_FULL_GPIOC_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOC_AF_MODE) ||
        ((GPIOC->PUPDR & CAMERA_SD_FULL_GPIOC_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOC_PULLUP) ||
        ((GPIOC->OSPEEDR & CAMERA_SD_FULL_GPIOC_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOC_MODE_MASK) ||
        ((GPIOC->OTYPER & CAMERA_SD_FULL_GPIOC_PIN_MASK) != 0U) ||
        ((GPIOC->AFR[1] & CAMERA_SD_FULL_GPIOC_AFRH_MASK) !=
         CAMERA_SD_FULL_GPIOC_AFRH_AF12) ||
        ((GPIOD->MODER & CAMERA_SD_FULL_GPIOD_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOD_AF_MODE) ||
        ((GPIOD->PUPDR & CAMERA_SD_FULL_GPIOD_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOD_PULLUP) ||
        ((GPIOD->OSPEEDR & CAMERA_SD_FULL_GPIOD_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOD_MODE_MASK) ||
        ((GPIOD->OTYPER & CAMERA_SD_FULL_GPIOD_PIN_MASK) != 0U) ||
        ((GPIOD->AFR[0] & CAMERA_SD_FULL_GPIOD_AFRL_MASK) !=
         CAMERA_SD_FULL_GPIOD_AFRL_AF12))
    {
        ++s_camera_sd_status.sdio_full_gpio_switch_error_count;
        s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
        s_camera_sd_status.last_sdio_full_gpio_error_code =
            CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED;
        s_camera_sd_status.last_sdio_full_gpio_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED;
    }

    ++s_camera_sd_status.sdio_full_gpio_switch_success_count;
    s_camera_sd_status.sdio_full_gpio_af12_selected = 1U;
    s_camera_sd_status.last_sdio_full_gpio_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_full_gpio_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_LeaveFullSdioGpioToInput(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.sdio_full_gpio_restore_attempt_count;

    /* 将 PC8～PC12 全部退回无上下拉的 GPIO 输入态。 */
    gpio.Pin = CAMERA_SD_FULL_GPIOC_PIN_MASK;
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &gpio);

    /* 将 PD2 同步退回 GPIO 输入态。 */
    gpio.Pin = CAMERA_SD_FULL_GPIOD_PIN_MASK;
    HAL_GPIO_Init(GPIOD, &gpio);

    s_camera_sd_status.sdio_af12_selected = 0U;
    s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;

    if (((GPIOC->MODER & CAMERA_SD_FULL_GPIOC_MODE_MASK) != 0U) ||
        ((GPIOC->PUPDR & CAMERA_SD_FULL_GPIOC_MODE_MASK) != 0U) ||
        ((GPIOD->MODER & CAMERA_SD_FULL_GPIOD_MODE_MASK) != 0U) ||
        ((GPIOD->PUPDR & CAMERA_SD_FULL_GPIOD_MODE_MASK) != 0U))
    {
        ++s_camera_sd_status.sdio_full_gpio_restore_error_count;
        s_camera_sd_status.conflict_pins_released = 0U;
        s_camera_sd_status.last_sdio_full_gpio_error_code =
            CAMERA_SD_ERR_SDIO_FULL_GPIO_RESTORE_FAILED;
        s_camera_sd_status.last_sdio_full_gpio_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SDIO_FULL_GPIO_RESTORE_FAILED;
    }

